Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F32B.tmx
Source language: en_us
Languages: zh_cn

source: Around the world by rail: part four - Darwin to Sydney
zh_cn: 环球火车旅行记：澳大利亚的汗铁路和印度洋太平洋铁路（4）

source: When the railway linking Adelaide to Darwin was finally completed in 2004 - 126 years after work on the project began - a Sydney journalist cruelly remarked that The Ghan, named in honour of the Afghan cameleers who opened up the Australian interior, was a train which went "from nowhere to nowhere".
zh_cn: 2004年从阿德莱德到达尔文的铁路终于全部建成了，这项工程开始于126年前。铁路被命名为“汗”，为的是纪念那些开拓了澳洲内陆的阿富汗赶驼人。当时有一位悉尼的记者无情地批评这是一条从“荒原通往荒原”的铁路。

source: In a nation which once prided itself on building roads, railways and bridges to conquer the "tyranny of distance" which marooned Europeans around the perimeter of Australia, The Ghan was seen as faintly ludicrous - an imperial relic from the 19th century.
zh_cn: 曾几何时澳大利亚以能够建造公路、铁路和桥梁来征服漫漫长途而感到自豪，遥远的距离曾一度使住在边远地区的欧洲移民与世隔绝。在这样一个国家里，“汗”铁路显得稍稍有点荒唐，这可以说是十九世纪帝国时代的遗物。

source: But the scene that greets me at the Darwin terminus on this sunny winter morning proves the doubters and naysayers wrong.
zh_cn: 但是在这个阳光明媚的冬日上午，我在达尔文车站看见的情景可以证明那些对这条铁路持怀疑态度的人是错误的。

source: There are six coaches of excited passengers, from young backpackers to sprightly seniors, queuing up outside the modern station.
zh_cn: 列车上的旅客装满了六个车厢，神情兴奋的旅客当中有年轻的背包客，也有神采奕奕的长者，他们在现代化的车站外面排起了长队。

source: So popular has The Ghan become that on some days the train comprises 31 coaches - its shiny aluminium form stretching far into the dry tropical scrub.
zh_cn: “汗”铁路已经变得如此繁忙，有时整列火车竟要拖挂31节车厢，那些闪闪发光的铝合金车厢一直延伸到热带干旱的灌木丛中。

source: The Darwin terminus may lack the grandeur of Europe's great stations or the frenetic bustle of an Indian one, but there is a tangible air of expectation.
zh_cn: 达尔文车站不像欧洲大火车站那样气度恢弘，也不像印度火车站那样杂乱无章，但是在这里我感到一种实实在在的期待。

source: Before us lies a journey of 1,851 miles through the heart of the Australian continent, but for the moment I'm faced with the prospect of just finding my carriage, P5, and my "Platinum" cabin - which I'm told comes with a double bed and a bathroom with "premium fittings".
zh_cn: 我们即将开始一次穿越澳洲腹地的旅行，旅程长达1851英里。但是眼下我要做的是找到P5车厢和我的“白金”等车室，我得知在我的车室里配备有双人大床和“设备精良”的卫生间。

source: I arrive in time to find a young assistant fitting a set of steps to the door - the train can be so long the architects obviously ditched the idea of building a platform that stretches half a mile long; it's a typical piece of Australian ingenuity - inelegant but practical.
zh_cn: 我来到车厢边上时正好年轻的助理列车员在车厢门口安放好踏脚梯——列车如此之长，建筑师们显然打消了建造一个半英里长站台的念头。这是典型的澳洲智慧，虽然不漂亮但很实用。

source: First impressions are overwhelmingly positive. My cabin, while not huge, provides the illusion of occupying your own sitting room.
zh_cn: 第一印象非常之好，我的车室虽然不大，但是给我一种坐在自己起居室里的感觉。

source: The attendant soon arrives with nibbles and a glass of chilled champagne and there's just time to pack away my things and twiddle with a few knobs and dials (all the cabins on The Ghan have an audio system and innumerable light switches) before the train edges its way out of the siding and south to Adelaide.
zh_cn: 服务员很快就来了，他给了我一点旅行小建议，还带来了一杯冰凉的香槟酒。这时我该打点一下我的随身物品，并且试一试车室里那些旋钮开关了，（“汗”列车上所有的车厢里都有扩音系统和无数的灯光开关）不久列车就要驶出支线驶向南方的阿德莱德。
